---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength
source: html/40c619fa-05e6-f8f0-9e78-ec7a30d209cf.htm
---
# RebarShapeConstraint180DegreeBendArcLength Members

Create a 180-degree bend constraint driven by arc length.